{"pageProps":{"post":{"title":"Resume Driven Development","date":"2024-04-01","description":"A reflection on technology choices in Software Engineering","thumbnail":{"url":"resume-driven-development.jpg","attribution":{"name":"Todd Kent","url":"https://unsplash.com/@churchoftodd?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText"}},"tags":["software","design","project","boring"],"filePath":"resume-driven-development.mdx","slug":"resume-driven-development","mdxSource":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    h1: \"h1\",\n    p: \"p\",\n    code: \"code\",\n    h2: \"h2\",\n    a: \"a\",\n    h3: \"h3\",\n    ul: \"ul\",\n    li: \"li\",\n    h4: \"h4\",\n    h5: \"h5\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.h1, {\n      children: \"Resume Driven Development\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"As software engineers we want to utilize the most effective tools, patterns and methodologies to fulfill our clients needs.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"A common mantra in our industry is \", _jsx(_components.code, {\n        children: \"\\\"Use the right tool for the job\\\"\"\n      }), \".  This idea gained momentum with the microservices hype, leading to a surge in polyglot programming, persistence, and more. This diversification has seen companies adopting a myriad of programming languages, persistence layers, frameworks, and tools in pursuit of the perfect solution, often overlooking the adequacy of existing tools within their stack.\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"A few years ago, I also fell into the trap of microservices and technology proliferation. Fortunately, the small size of our team and our codebase made the damage reversible and manageable.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"This experience made me pause and take time for introspection. Was I genuinely choosing the right tools for the project or was I unconsciously choosing shiny tools that would make my resume more interesting?\\nDespite my best intentions, I couldn't completely disregard the personal desire for learning about them.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"This realization led me to adopt a more judicious and methodical approach to integrating new technologies into our projects\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Adding a new tech to the stack\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Introducing new technology—be it a language, framework, persistence layer, message broker, etc.—requires a learning curve. We love exploring new tools and the novelty of solving use cases and enabling features, needed or not. We tend to underestimate the learning curve of understanding how they fail, when they tend to fail, how the errors are discovered or monitored, and designing how to recover from those errors.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The real test often comes after deployment, challenging us to reassess the need for that new technology after we've already introduced it.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Thus, I urge you to think twice before expanding your tech stack.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Chosing technology\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"During the introspection period I stumbled into thought-provoking piece titled \", _jsx(_components.a, {\n        href: \"https://mcfunley.com/choose-boring-technology\",\n        children: \"Chose boring technology\"\n      }), \", which eloquently argued against the rush to adopt new technologies and embrace the boring ones, understanding \", _jsx(_components.code, {\n        children: \"boring\"\n      }), \" as the ones we know and understand well and, therefore, don't give any surprises.\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If your project already has an established tech stack, here are some considerations before introducing new technology:\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Can the existing tech stack address the problem?\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Design the solution with the current stack, without adding any new technology. If the design is feasible, it can be the baseline for the decision.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Some challenges for the design:\"\n    }), \"\\n\", _jsxs(_components.ul, {\n      children: [\"\\n\", _jsx(_components.li, {\n        children: \"Would it be compliant with the non-functional requirements or SLAs?\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"How complex or maintailable is the implementation?\"\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Future project features\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Assess whether the planned features or project direction could benefit from introducing the tech stack.\\nFor example some technologies can act as enablers for future features.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Team expertise\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Consider the team's familiarity with the new technology and the implications of acquiring or hiring expertise.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Real-World naive Example\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Let's consider a hypothetical project with the following tech stack:\"\n    }), \"\\n\", _jsxs(_components.ul, {\n      children: [\"\\n\", _jsx(_components.li, {\n        children: \"React in front end\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Nodejs in the backend (with Express)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Postgres as the main database\"\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Your data is structured and fits well in a relational database. Your application is mostly a CRUD application.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Life is good, and things are working as expected until a couple of new features appear in the backlog.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Feature 1: Integrating unstructured data\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"You have a new feature that—for some reason—requires storing unstructured data. When investigating tools, you find Document DBs, one of them being MongoDB.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Although it would look great on your—and your team members'—resumes, you think twice, remember a blog post you read some time ago, and decide carefully. That would be the right tool for the job. But, do you really need it?\"\n    }), \"\\n\", _jsx(_components.h4, {\n      children: \"Can the existing tech stack address the problem?\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"You create a design with the current stack. After some research, you learn that Postgres supports JSON or JSONB column types that can store unstructured data. Your design includes a JSONB column in the table, and you can query it as you would with a document database.\"\n    }), \"\\n\", _jsx(_components.h4, {\n      children: \"Future project features\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"After scanning through the product backlog, nothing calls your attention that could break your design.\"\n    }), \"\\n\", _jsx(_components.h4, {\n      children: \"Team expertise\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The team has a lot of experience with Postgres and a couple of team members are certified in MongoDB.\"\n    }), \"\\n\", _jsx(_components.h4, {\n      children: \"Decision\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Keeping the tech stack and using Postgres' JSONB column type seems the sensible approach.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Feature 2: Real-time* notifications\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The team is to work on a new feature that requires real-time* notifications. Some actions need to be notified to the affected users.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"When investigating about events, real-time notifications, you find out about message brokers like NATS Server, RabbitMQ, or Kafka. You consider adding them to the tech stack. But—of course—you think twice and follow your process to make the right decision.\"\n    }), \"\\n\", _jsx(_components.h4, {\n      children: \"Can the existing tech stack address the problem?\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"After some research, you find out that PostgreSQL has LISTEN/NOTIFY that supports the Pub/Sub pattern and could be used to subscribe to changes and produce the right notifications. You also read about the outpost pattern that could be used for the feature at hand.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"You create two designs, one using LISTEN/NOTIFY and the other using the outpost pattern.\"\n    }), \"\\n\", _jsx(_components.h5, {\n      children: \"LISTEN/NOTIFY\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"This approach could work and your design seems correct.\\nOne of the drawbacks is the performance of the database. The more subscribers, the more load on the database. That might impact your queries and the performance of the website.\"\n    }), \"\\n\", _jsx(_components.h5, {\n      children: \"Outpost pattern\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Agains, this approach could work and seems elegant and simple.\\nOne of the drawbacks is that you would need to add a new table for each subscription type (push notifications, emails, etc).\\nFor the feature at hand you only need one subscription but that limitation is something to consider.\"\n    }), \"\\n\", _jsx(_components.h4, {\n      children: \"What other features are down the line?\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Scanning through the backlog you find multiple stories related to notifications, real-time updates, etc.\\nYour choice will need to consider that shift towards real-time event-driven features.\"\n    }), \"\\n\", _jsx(_components.h4, {\n      children: \"How much expertise about that tool do we have in the team?\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The team has a lot of experience with Postgres but not using LISTEN/NOTIFY.\\nSome of the team members know well RabbitMQ and/or Kafka.\"\n    }), \"\\n\", _jsx(_components.h4, {\n      children: \"Decision\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"You decide that using Postgres alone is not suitable for these features and the ones to come. Adding a message broker is needed and will enable more features in the future. Based on what you learn from researching PostgreSQL, you decide that a combination of the outpost pattern and a message broker is the way to go.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"After some more research, your team decides to go with RabbitMQ.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Conclusion\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"These examples, while simplified, illustrate the essence of deliberate technology selection. We're naturally drawn to the latest innovations, eager to explore their potential and how they might enhance our projects. But it's crucial to choose mindfully.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Adding a new technology to our stack should come after thoughtful consideration. Even if a tool is perfect for the job, the price of adding it to our stack might outweigh the benefits it brings.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.a, {\n        href: \"https://github.com/tonitienda/kadai\",\n        children: \"Personal projects\"\n      }), \" offer the perfect playground for experimentation, allowing us to satisfy our appetite for learning without risking the integrity of our professional endeavors. By reserving our exploratory impulses for these spaces, we can approach our work projects with a more focused and pragmatic mindset. What we learn in those personal projects can be applied to our work projects, but only after a thorough evaluation of the potential benefits and drawbacks.\"]\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"markdown":"# Resume Driven Development\n\nAs software engineers we want to utilize the most effective tools, patterns and methodologies to fulfill our clients needs.\n\nA common mantra in our industry is `\"Use the right tool for the job\"`.  This idea gained momentum with the microservices hype, leading to a surge in polyglot programming, persistence, and more. This diversification has seen companies adopting a myriad of programming languages, persistence layers, frameworks, and tools in pursuit of the perfect solution, often overlooking the adequacy of existing tools within their stack.\n\nA few years ago, I also fell into the trap of microservices and technology proliferation. Fortunately, the small size of our team and our codebase made the damage reversible and manageable.\n\nThis experience made me pause and take time for introspection. Was I genuinely choosing the right tools for the project or was I unconsciously choosing shiny tools that would make my resume more interesting? \nDespite my best intentions, I couldn't completely disregard the personal desire for learning about them.\n\nThis realization led me to adopt a more judicious and methodical approach to integrating new technologies into our projects\n\n## Adding a new tech to the stack\n\nIntroducing new technology—be it a language, framework, persistence layer, message broker, etc.—requires a learning curve. We love exploring new tools and the novelty of solving use cases and enabling features, needed or not. We tend to underestimate the learning curve of understanding how they fail, when they tend to fail, how the errors are discovered or monitored, and designing how to recover from those errors.\n\nThe real test often comes after deployment, challenging us to reassess the need for that new technology after we've already introduced it.\n\nThus, I urge you to think twice before expanding your tech stack.\n\n## Chosing technology\n\nDuring the introspection period I stumbled into thought-provoking piece titled [Chose boring technology](https://mcfunley.com/choose-boring-technology), which eloquently argued against the rush to adopt new technologies and embrace the boring ones, understanding `boring` as the ones we know and understand well and, therefore, don't give any surprises.\n\nIf your project already has an established tech stack, here are some considerations before introducing new technology:\n\n### Can the existing tech stack address the problem?\n\nDesign the solution with the current stack, without adding any new technology. If the design is feasible, it can be the baseline for the decision. \n\nSome challenges for the design:\n\n- Would it be compliant with the non-functional requirements or SLAs?\n- How complex or maintailable is the implementation?\n\n### Future project features\n\nAssess whether the planned features or project direction could benefit from introducing the tech stack.\nFor example some technologies can act as enablers for future features.\n\n\n### Team expertise\n\nConsider the team's familiarity with the new technology and the implications of acquiring or hiring expertise.\n\n\n## Real-World naive Example\n\nLet's consider a hypothetical project with the following tech stack: \n\n- React in front end\n- Nodejs in the backend (with Express)\n- Postgres as the main database\n\nYour data is structured and fits well in a relational database. Your application is mostly a CRUD application.\n\nLife is good, and things are working as expected until a couple of new features appear in the backlog.\n\n### Feature 1: Integrating unstructured data\n\nYou have a new feature that—for some reason—requires storing unstructured data. When investigating tools, you find Document DBs, one of them being MongoDB.\n\nAlthough it would look great on your—and your team members'—resumes, you think twice, remember a blog post you read some time ago, and decide carefully. That would be the right tool for the job. But, do you really need it?\n\n#### Can the existing tech stack address the problem?\n\nYou create a design with the current stack. After some research, you learn that Postgres supports JSON or JSONB column types that can store unstructured data. Your design includes a JSONB column in the table, and you can query it as you would with a document database.\n\n#### Future project features\n\nAfter scanning through the product backlog, nothing calls your attention that could break your design.\n\n####  Team expertise\n\nThe team has a lot of experience with Postgres and a couple of team members are certified in MongoDB.\n\n#### Decision\n\nKeeping the tech stack and using Postgres' JSONB column type seems the sensible approach.\n\n### Feature 2: Real-time\\* notifications\n\nThe team is to work on a new feature that requires real-time* notifications. Some actions need to be notified to the affected users.\n\nWhen investigating about events, real-time notifications, you find out about message brokers like NATS Server, RabbitMQ, or Kafka. You consider adding them to the tech stack. But—of course—you think twice and follow your process to make the right decision.\n\n#### Can the existing tech stack address the problem?\n\nAfter some research, you find out that PostgreSQL has LISTEN/NOTIFY that supports the Pub/Sub pattern and could be used to subscribe to changes and produce the right notifications. You also read about the outpost pattern that could be used for the feature at hand.\n\nYou create two designs, one using LISTEN/NOTIFY and the other using the outpost pattern.\n\n##### LISTEN/NOTIFY\n\nThis approach could work and your design seems correct.\nOne of the drawbacks is the performance of the database. The more subscribers, the more load on the database. That might impact your queries and the performance of the website.\n\n##### Outpost pattern\n\nAgains, this approach could work and seems elegant and simple.\nOne of the drawbacks is that you would need to add a new table for each subscription type (push notifications, emails, etc).\nFor the feature at hand you only need one subscription but that limitation is something to consider.\n\n#### What other features are down the line?\n\nScanning through the backlog you find multiple stories related to notifications, real-time updates, etc.\nYour choice will need to consider that shift towards real-time event-driven features.\n\n#### How much expertise about that tool do we have in the team?\n\nThe team has a lot of experience with Postgres but not using LISTEN/NOTIFY.\nSome of the team members know well RabbitMQ and/or Kafka.\n\n#### Decision\n\nYou decide that using Postgres alone is not suitable for these features and the ones to come. Adding a message broker is needed and will enable more features in the future. Based on what you learn from researching PostgreSQL, you decide that a combination of the outpost pattern and a message broker is the way to go.\n\nAfter some more research, your team decides to go with RabbitMQ. \n\n## Conclusion\n\nThese examples, while simplified, illustrate the essence of deliberate technology selection. We're naturally drawn to the latest innovations, eager to explore their potential and how they might enhance our projects. But it's crucial to choose mindfully.\n\nAdding a new technology to our stack should come after thoughtful consideration. Even if a tool is perfect for the job, the price of adding it to our stack might outweigh the benefits it brings.\n\n[Personal projects](https://github.com/tonitienda/kadai) offer the perfect playground for experimentation, allowing us to satisfy our appetite for learning without risking the integrity of our professional endeavors. By reserving our exploratory impulses for these spaces, we can approach our work projects with a more focused and pragmatic mindset. What we learn in those personal projects can be applied to our work projects, but only after a thorough evaluation of the potential benefits and drawbacks."}},"__N_SSG":true}